---
kind: method
id: M:Autodesk.Revit.DB.ElementId.op_Equality(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
source: html/34a21be8-c836-0ac0-fdc8-d45b112ac580.htm
---
# Autodesk.Revit.DB.ElementId.op_Equality Method

Determines whether these two ElementIds are the same.

## Syntax (C#)
```csharp
public static bool operator ==(
	ElementId first,
	ElementId second
)
```

## Parameters
- **first** (`Autodesk.Revit.DB.ElementId`) - The first ElementId.
- **second** (`Autodesk.Revit.DB.ElementId`) - The second ElementId.

## Returns
True if the ElementIds are the same; otherwise, false.